tiborsimon/embedded-tdd-headers/pic/pic18/pic18f2680_tdd.h
#define TXB2EID0                      2765
#define TXB2EIDL_EID0                 2766
#define TXB2EID1                      2767
#define TXB2EIDL_EID1                 2768
#define TXB2EID2                      2769
#define TXB2EIDL_EID2                 2770
#define TXB2EID3                      2771
#define TXB2EIDL_EID3                 2772
#define TXB2EID4                      2773
#define TXB2EIDL_EID4                 2774
#define TXB2EID5                      2775
#define TXB2EIDL_EID5                 2776
#define TXB2EID6                      2777
#define TXB2EIDL_EID6                 2778
#define TXB2EID7                      2779
#define TXB2EIDL_EID7                 2780
#define TXB2DLC                       2781
#define TXB2DLC0                      2782
#define TXB2DLC_DLC0                  2783
#define TXB2DLC1                      2784
#define TXB2DLC_DLC1                  2785
#define TXB2DLC2                      2786
#define TXB2DLC_DLC2                  2787
#define TXB2DLC_DLC3                  2788
#define TXB2DLC3                      2789
#define TXB2DLC_TXRTR                 2790
#define TXB2RTR                       2791
#define TXB2D0                        2792
#define TXB2D00                       2793
#define TXB2D01                       2794
#define TXB2D02                       2795
#define TXB2D03                       2796
#define TXB2D04                       2797
#define TXB2D05                       2798
#define TXB2D06                       2799
#define TXB2D07                       2800
#define TXB2D1                        2801
#define TXB2D10                       2802
#define TXB2D11                       2803
#define TXB2D12                       2804
#define TXB2D13                       2805
#define TXB2D14                       2806
#define TXB2D15                       2807
#define TXB2D16                       2808
#define TXB2D17                       2809
#define TXB2D2                        2810
#define TXB2D20                       2811
#define TXB2D21                       2812
#define TXB2D22                       2813
#define TXB2D23                       2814
#define TXB2D24                       2815
#define TXB2D25                       2816
#define TXB2D26                       2817
#define TXB2D27                       2818
#define TXB2D3                        2819
#define TXB2D30                       2820
#define TXB2D31                       2821
#define TXB2D32                       2822
#define TXB2D33                       2823
#define TXB2D34                       2824
#define TXB2D35                       2825
#define TXB2D36                       2826
#define TXB2D37                       2827
#define TXB2D4                        2828
#define TXB2D40                       2829
#define TXB2D41                       2830
#define TXB2D42                       2831
#define TXB2D43                       2832
#define TXB2D44                       2833
#define TXB2D45                       2834
#define TXB2D46                       2835
#define TXB2D47                       2836
#define TXB2D5                        2837
#define TXB2D50                       2838
#define TXB2D51                       2839
#define TXB2D52                       2840
#define TXB2D53                       2841
#define TXB2D54                       2842
#define TXB2D55                       2843
#define TXB2D56                       2844
#define TXB2D57                       2845
#define TXB2D6                        2846
#define TXB2D60                       2847
#define TXB2D61                       2848
#define TXB2D62                       2849
#define TXB2D63                       2850
#define TXB2D64                       2851
#define TXB2D65                       2852
#define TXB2D66                       2853
#define TXB2D67                       2854
#define TXB2D7                        2855
#define TXB2D70                       2856
#define TXB2D71                       2857
#define TXB2D72                       2858
#define TXB2D73                       2859
#define TXB2D74                       2860
#define TXB2D75                       2861
#define TXB2D76                       2862
#define TXB2D77                       2863
#define CANSTAT_RO3                   2864
#define CANSTAT_RO3_EICODE0           2865
#define CANSTAT_RO3_ICODE0            2866
#define CANSTAT_RO3_ICODE1            2867
#define CANSTAT_RO3_EICODE1_ICODE0    2868
#define CANSTAT_RO3_EICODE2_ICODE1    2869
#define CANSTAT_RO3_ICODE2            2870
#define CANSTAT_RO3_EICODE3_ICODE2    2871
#define CANSTAT_RO3_ICODE3            2872
#define CANSTAT_RO3_EICODE4           2873
#define CANSTAT_RO3_ICODE4            2874
#define CANSTAT_RO3_OPMODE0           2875
#define CANSTAT_RO3_OPMODE1           2876
#define CANSTAT_RO3_OPMODE2           2877
#define CANCON_RO3                    2878
#define CANCON_RO3_FP0                2879
#define CANCON_RO3_WIN0_FP1           2880
#define CANCON_RO3_WIN0               2881
#define CANCON_RO3_WIN1_FP2           2882
#define CANCON_RO3_WIN1               2883
#define CANCON_RO3_WIN2_FP3           2884
#define CANCON_RO3_WIN2               2885
#define CANCON_RO3_ABAT               2886
#define CANCON_RO3_REQOP0             2887
#define CANCON_RO3_REQOP1             2888
#define CANCON_RO3_REQOP2             2889
#define TXB1CON                       2890
#define TXB1PRI0                      2891
#define TXB1CON_TXPRI0                2892
#define TXB1PRI1                      2893
#define TXB1CON_TXPRI1                2894
#define TXB1REQ                       2895
#define TXB1CON_TXREQ                 2896
#define TXB1CON_TXERR                 2897
#define TXB1ERR                       2898
#define TXB1LARB                      2899
#define TXB1CON_TXLARB                2900
#define TXB1ABT                       2901
#define TXB1CON_TXABT                 2902
#define TXB1CON_TX1IF                 2903
#define TXBIFTXB1CON                  2904
#define TXB1CON_TXBIF                 2905
#define TXB1SIDH                      2906
#define TXB1SIDH_SID3                 2907
#define TXB1SID3                      2908
#define TXB1SIDH_SID4                 2909
#define TXB1SID4                      2910
#define TXB1SIDH_SID5                 2911
#define TXB1SID5                      2912
#define TXB1SIDH_SID6                 2913
#define TXB1SID6                      2914
#define TXB1SIDH_SID7                 2915
#define TXB1SID7                      2916
#define TXB1SIDH_SID8                 2917
#define TXB1SID8                      2918
#define TXB1SIDH_SID9                 2919
#define TXB1SID9                      2920
#define TXB1SID10                     2921
#define TXB1SIDH_SID10                2922
#define TXB1SIDL                      2923
#define TXB1SIDL_EID16                2924
#define TXB1EID16                     2925
#define TXB1SIDL_EID17                2926
#define TXB1EID17                     2927
#define TXB1EXIDE                     2928
#define TXB1SIDL_EXIDE                2929
#define TXB1SID0                      2930
#define TXB1SIDL_SID0                 2931
#define TXB1SID1                      2932
#define TXB1SIDL_SID1                 2933
#define TXB1SID2                      2934
#define TXB1SIDL_SID2                 2935
#define TXB1EIDH                      2936
#define TXB1EID8                      2937
#define TXB1EIDH_EID8                 2938
#define TXB1EID9                      2939
#define TXB1EIDH_EID9                 2940
#define TXB1EID10                     2941
#define TXB1EIDH_EID10                2942
#define TXB1EID11                     2943
#define TXB1EIDH_EID11                2944
#define TXB1EID12                     2945
#define TXB1EIDH_EID12                2946
#define TXB1EID13                     2947
#define TXB1EIDH_EID13                2948
#define TXB1EID14                     2949
#define TXB1EIDH_EID14                2950
#define TXB1EID15                     2951
#define TXB1EIDH_EID15                2952
#define TXB1EIDL                      2953
#define TXB1EIDL_EID0                 2954
#define TXB1EID0                      2955
#define TXB1EIDL_EID1                 2956
#define TXB1EID1                      2957
#define TXB1EIDL_EID2                 2958
#define TXB1EID2                      2959
#define TXB1EIDL_EID3                 2960
#define TXB1EID3                      2961
#define TXB1EIDL_EID4                 2962
#define TXB1EID4                      2963
#define TXB1EIDL_EID5                 2964
#define TXB1EID5                      2965
#define TXB1EIDL_EID6                 2966
#define TXB1EID6                      2967
#define TXB1EIDL_EID7                 2968
#define TXB1EID7                      2969
#define TXB1DLC                       2970
#define TXB1DLC0                      2971
#define TXB1DLC_DLC0                  2972
#define TXB1DLC_DLC1                  2973
#define TXB1DLC1                      2974
#define TXB1DLC_DLC2                  2975
#define TXB1DLC2                      2976
#define TXB1DLC_DLC3                  2977
#define TXB1DLC3                      2978
#define TXB1RTR                       2979
#define TXB1DLC_TXRTR                 2980
#define TXB1D0                        2981
#define TXB1D00                       2982
#define TXB1D01                       2983
#define TXB1D02                       2984
#define TXB1D03                       2985
#define TXB1D04                       2986
#define TXB1D05                       2987
#define TXB1D06                       2988
#define TXB1D07                       2989
#define TXB1D1                        2990
#define TXB1D10                       2991
#define TXB1D11                       2992
#define TXB1D12                       2993
#define TXB1D13                       2994
#define TXB1D14                       2995
#define TXB1D15                       2996
#define TXB1D16                       2997
#define TXB1D17                       2998
#define TXB1D2                        2999
#define TXB1D20                       3000
#define TXB1D21                       3001
#define TXB1D22                       3002
#define TXB1D23                       3003
#define TXB1D24                       3004
#define TXB1D25                       3005
#define TXB1D26                       3006
#define TXB1D27                       3007
#define TXB1D3                        3008
#define TXB1D30                       3009
#define TXB1D31                       3010
#define TXB1D32                       3011
#define TXB1D33                       3012
#define TXB1D34                       3013
#define TXB1D35                       3014
#define TXB1D36                       3015
#define TXB1D37                       3016
#define TXB1D4                        3017
#define TXB1D40                       3018
#define TXB1D41                       3019
#define TXB1D42                       3020
#define TXB1D43                       3021
#define TXB1D44                       3022
#define TXB1D45                       3023
#define TXB1D46                       3024
#define TXB1D47                       3025
#define TXB1D5                        3026
#define TXB1D50                       3027
#define TXB1D51                       3028
#define TXB1D52                       3029
#define TXB1D53                       3030
#define TXB1D54                       3031
#define TXB1D55                       3032
#define TXB1D56                       3033
#define TXB1D57                       3034
#define TXB1D6                        3035
#define TXB1D60                       3036
#define TXB1D61                       3037
#define TXB1D62                       3038
#define TXB1D63                       3039
#define TXB1D64                       3040
#define TXB1D65                       3041
#define TXB1D66                       3042
#define TXB1D67                       3043
#define TXB1D7                        3044
#define TXB1D70                       3045
#define TXB1D71                       3046
#define TXB1D72                       3047
#define TXB1D73                       3048
#define TXB1D74                       3049
#define TXB1D75                       3050
#define TXB1D76                       3051
#define TXB1D77                       3052
#define CANSTAT_RO2                   3053
#define CANSTAT_RO2_EICODE0           3054
#define CANSTAT_RO2_ICODE0            3055
#define CANSTAT_RO2_EICODE1_ICODE0    3056
#define CANSTAT_RO2_ICODE1            3057
#define CANSTAT_RO2_EICODE2_ICODE1    3058
#define CANSTAT_RO2_ICODE2            3059
#define CANSTAT_RO2_EICODE3_ICODE2    3060
#define CANSTAT_RO2_ICODE3            3061
#define CANSTAT_RO2_EICODE4           3062
#define CANSTAT_RO2_ICODE4            3063
#define CANSTAT_RO2_OPMODE0           3064
#define CANSTAT_RO2_OPMODE1           3065
#define CANSTAT_RO2_OPMODE2           3066
#define CANCON_RO2                    3067
#define CANCON_RO2_FP0                3068
#define CANCON_RO2_WIN0               3069
#define CANCON_RO2_WIN0_FP1           3070
#define CANCON_RO2_WIN1_FP2           3071
#define CANCON_RO2_WIN1               3072
#define CANCON_RO2_WIN2               3073
#define CANCON_RO2_WIN2_FP3           3074
#define CANCON_RO2_ABAT               3075
#define CANCON_RO2_REQOP0             3076
#define CANCON_RO2_REQOP1             3077
#define CANCON_RO2_REQOP2             3078
#define TXB0CON                       3079
#define TXB0PRI0                      3080
#define TXB0CON_TXPRI0                3081
#define TXB0CON_TXPRI1                3082
#define TXB0PRI1                      3083
#define TXB0REQ                       3084
#define TXB0CON_TXREQ                 3085
#define TXB0CON_TXERR                 3086
#define TXB0ERR                       3087
#define TXB0CON_TXLARB                3088
#define TXB0LARB                      3089
#define TXB0ABT                       3090
#define TXB0CON_TXABT                 3091
#define TXB0CON_TXBIF                 3092
#define TX0IF                         3093
#define TXB0SIDH                      3094
#define TXB0SID3                      3095
#define TXB0SIDH_SID3                 3096
#define TXB0SID4                      3097
#define TXB0SIDH_SID4                 3098
#define TXB0SID5                      3099
#define TXB0SIDH_SID5                 3100
#define TXB0SID6                      3101
#define TXB0SIDH_SID6                 3102
#define TXB0SID7                      3103
#define TXB0SIDH_SID7                 3104
#define TXB0SID8                      3105
#define TXB0SIDH_SID8                 3106
#define TXB0SID9                      3107
#define TXB0SIDH_SID9                 3108
#define TXB0SIDH_SID10                3109
#define TXB0SID10                     3110
#define TXB0SIDL                      3111
#define TXB0EID16                     3112
#define TXB0SIDL_EID16                3113
#define TXB0EID17                     3114
#define TXB0SIDL_EID17                3115
#define TXB0SIDL_EXIDE                3116
#define TXB0EXIDE                     3117
#define TXB0SID0                      3118
#define TXB0SIDL_SID0                 3119
#define TXB0SID1                      3120
#define TXB0SIDL_SID1                 3121
#define TXB0SID2                      3122
#define TXB0SIDL_SID2                 3123
#define TXB0EIDH                      3124
#define TXB0EID8                      3125
#define TXB0EIDH_EID8                 3126
#define TXB0EID9                      3127
#define TXB0EIDH_EID9                 3128
#define TXB0EIDH_EID10                3129
#define TXB0EID10                     3130
#define TXB0EID11                     3131
#define TXB0EIDH_EID11                3132
#define TXB0EIDH_EID12                3133
#define TXB0EID12                     3134
#define TXB0EIDH_EID13                3135
#define TXB0EID13                     3136
#define TXB0EIDH_EID14                3137
#define TXB0EID14                     3138
#define TXB0EIDH_EID15                3139
#define TXB0EID15                     3140
#define TXB0EIDL                      3141
#define TXB0EIDL_EID0                 3142
#define TXB0EID0                      3143
#define TXB0EIDL_EID1                 3144
#define TXB0EID1                      3145
#define TXB0EIDL_EID2                 3146
#define TXB0EID2                      3147
#define TXB0EIDL_EID3                 3148
#define TXB0EID3                      3149
#define TXB0EIDL_EID4                 3150
#define TXB0EID4                      3151
#define TXB0EIDL_EID5                 3152
#define TXB0EID5                      3153
#define TXB0EIDL_EID6                 3154
#define TXB0EID6                      3155
#define TXB0EIDL_EID7                 3156
#define TXB0EID7                      3157
#define TXB0DLC                       3158
#define TXB0DLC0                      3159
#define TXB0DLC_DLC0                  3160
#define TXB0DLC1                      3161
#define TXB0DLC_DLC1                  3162
#define TXB0DLC2                      3163
#define TXB0DLC_DLC2                  3164
#define TXB0DLC3                      3165
#define TXB0DLC_DLC3                  3166
#define TXB0RTR                       3167
#define TXB0DLC_TXRTR                 3168
#define TXB0D0                        3169
#define TXB0D00                       3170
#define TXB0D01                       3171
#define TXB0D02                       3172
#define TXB0D03                       3173
#define TXB0D04                       3174
#define TXB0D05                       3175
#define TXB0D06                       3176
#define TXB0D07                       3177
#define TXB0D1                        3178
#define TXB0D10                       3179
#define TXB0D11                       3180
#define TXB0D12                       3181
#define TXB0D13                       3182
#define TXB0D14                       3183
#define TXB0D15                       3184
#define TXB0D16                       3185
#define TXB0D17                       3186
#define TXB0D2                        3187
#define TXB0D20                       3188
#define TXB0D21                       3189
#define TXB0D22                       3190
#define TXB0D23                       3191
#define TXB0D24                       3192
#define TXB0D25                       3193
#define TXB0D26                       3194
#define TXB0D27                       3195
#define TXB0D3                        3196
#define TXB0D30                       3197
#define TXB0D31                       3198
#define TXB0D32                       3199
#define TXB0D33                       3200
#define TXB0D34                       3201
#define TXB0D35                       3202
#define TXB0D36                       3203
#define TXB0D37                       3204
#define TXB0D4                        3205
#define TXB0D40                       3206
#define TXB0D41                       3207
#define TXB0D42                       3208
#define TXB0D43                       3209
#define TXB0D44                       3210
#define TXB0D45                       3211
#define TXB0D46                       3212
#define TXB0D47                       3213
#define TXB0D5                        3214
#define TXB0D50                       3215
#define TXB0D51                       3216
#define TXB0D52                       3217
#define TXB0D53                       3218
#define TXB0D54                       3219
#define TXB0D55                       3220
#define TXB0D56                       3221
#define TXB0D57                       3222
#define TXB0D6                        3223
#define TXB0D60                       3224
#define TXB0D61                       3225
#define TXB0D62                       3226
#define TXB0D63                       3227
#define TXB0D64                       3228
#define TXB0D65                       3229
#define TXB0D66                       3230
#define TXB0D67                       3231
#define TXB0D7                        3232
#define TXB0D70                       3233
#define TXB0D71                       3234
#define TXB0D72                       3235
#define TXB0D73                       3236
#define TXB0D74                       3237
#define TXB0D75                       3238
#define TXB0D76                       3239
#define TXB0D77                       3240
#define CANSTAT_RO1                   3241
#define CANSTAT_RO1_EICODE0           3242
#define CANSTAT_RO1_ICODE0            3243
#define CANSTAT_RO1_ICODE1            3244
#define CANSTAT_RO1_EICODE1_ICODE0    3245
#define CANSTAT_RO1_ICODE2            3246
#define CANSTAT_RO1_EICODE2_ICODE1    3247
#define CANSTAT_RO1_EICODE3_ICODE2    3248
#define CANSTAT_RO1_ICODE3            3249
#define CANSTAT_RO1_ICODE4            3250
#define CANSTAT_RO1_EICODE4           3251
#define CANSTAT_RO1_OPMODE0           3252
#define CANSTAT_RO1_OPMODE1           3253
#define CANSTAT_RO1_OPMODE2           3254
#define CANCON_RO1                    3255
#define CANCON_RO1_FP0                3256
#define CANCON_RO1_WIN0_FP1           3257
#define CANCON_RO1_WIN0               3258
#define CANCON_RO1_WIN1               3259
#define CANCON_RO1_WIN1_FP2           3260
#define CANCON_RO1_WIN2_FP3           3261
#define CANCON_RO1_WIN2               3262
#define CANCON_RO1_ABAT               3263
#define CANCON_RO1_REQOP0             3264
#define CANCON_RO1_REQOP1             3265
#define CANCON_RO1_REQOP2             3266
#define RXB1CON                       3267
#define RXB1CON_FILHIT0               3268
#define RXB1FILHIT0                   3269
#define RXB1CON_FILHIT1               3270
#define RXB1FILHIT1                   3271
#define RXB1CON_FILHIT2               3272
#define RXB1FILHIT2                   3273
#define RXB1CON_RXRTRRO               3274
#define RXB1CON_FILHIT3               3275
#define RXB1RTRR0                     3276
#define RXB1FILHIT3                   3277
#define RXB1CON_RXRTRRO_FILHIT3       3278
#define RXB1CON_FILHIT4               3279
#define RXB1FILHIT4                   3280
#define RXB1M0                        3281
#define RXB1CON_RXM0_RTRRO            3282
#define RXB1RTRRO                     3283
#define RXB1CON_RTRRO                 3284
#define RXB1CON_RXM0                  3285
#define RXB1M1                        3286
#define RXB1CON_RXM1                  3287
#define RXB1FUL                       3288
#define RXB1CON_RXFUL                 3289
#define RXB1SIDH                      3290
#define RXB1SID3                      3291
#define RXB1SIDH_SID3                 3292
#define RXB1SID4                      3293
#define RXB1SIDH_SID4                 3294
#define RXB1SID5                      3295
#define RXB1SIDH_SID5                 3296
#define RXB1SID6                      3297
#define RXB1SIDH_SID6                 3298
#define RXB1SID7                      3299
#define RXB1SIDH_SID7                 3300
#define RXB1SID8                      3301
#define RXB1SIDH_SID8                 3302
#define RXB1SID9                      3303
#define RXB1SIDH_SID9                 3304
#define RXB1SIDH_SID10                3305
#define RXB1SID10                     3306
#define RXB1SIDL                      3307
#define RXB1SIDL_EID16                3308
#define RXB1EID16                     3309
#define RXB1SIDL_EID17                3310
#define RXB1EID17                     3311
#define RXB1EXID                      3312
#define RXB1SIDL_EXID                 3313
#define RXB1SRR                       3314
#define RXB1SIDL_SRR                  3315
#define RXB1SID0                      3316
#define RXB1SIDL_SID0                 3317
#define RXB1SIDL_SID1                 3318
#define RXB1SID1                      3319
#define RXB1SIDL_SID2                 3320
#define RXB1SID2                      3321
#define RXB1EIDH                      3322
